namespace RAGENativeUI.Internals
{
    using System;
    using System.Diagnostics;
    using System.Drawing;
    using System.Linq;
    using System.Runtime.CompilerServices;
    using System.Runtime.InteropServices;

    using Rage;

    internal static unsafe class Memory
    {
        [Conditional("DEBUG")]
        private static void Log(string str) => Game.LogTrivialDebug($"[RAGENativeUI::{nameof(Memory)}] {str}");

        public const int MaxMemoryAddresses = 20;
        public const int MaxInts = 4;
        
        public static readonly int sysMemAllocator_Allocate_VTableOffset = -1;
        public static readonly int TLSOffset_sysMemAllocator_Current = -1;
        public static readonly int TLSOffset_sysMemAllocator_Master = -1;
        public static readonly IntPtr Screen_GetActualWidth, Screen_GetActualHeight;
        public static readonly IntPtr CTextStyle_ScriptStyle;
        public static readonly IntPtr CScaleformMgr_IsMovieRendering;
        public static readonly IntPtr CScaleformMgr_BeginMethod;
        public static readonly IntPtr CBusySpinner_InstructionalButtons;
        public static readonly IntPtr scrProgramRegistry_sm_Instance;
        public static readonly IntPtr scrProgramRegistry_Find;
        public static readonly IntPtr Native_DisableControlAction;
        public static readonly IntPtr Native_DrawSprite;
        public static readonly IntPtr Native_DrawRect;
        public static readonly IntPtr CTextFormat_GetInputSourceIcons;

                        index = newIndex;
                        return true;
                    }

                    return false;
                }

                public ref uint Current
                {
                    [System.Runtime.CompilerServices.MethodImpl(System.Runtime.CompilerServices.MethodImplOptions.AggressiveInlining)]
                    get => ref (*array)[index];
                }
            }
        }
#endif
    }

    internal static class Screen
    {
        public static readonly bool Available = Memory.Screen_GetActualWidth != IntPtr.Zero && Memory.Screen_GetActualHeight != IntPtr.Zero;

        /// <summary>
        /// Gets the resolution of the main screen, the one containing the UI in case multiple screens are used.
        /// </summary>
        public static unsafe SizeF ActualResolution
        {
            get
            {
                if (Available)
                {
                    using var tls = UsingTls.Scope();

                    var w = ((delegate* unmanaged[Stdcall]<float>)Memory.Screen_GetActualWidth)();
                    var h = ((delegate* unmanaged[Stdcall]<float>)Memory.Screen_GetActualHeight)();
                    return new SizeF(w, h);
                }
                else
                {
                    return Game.Resolution; // not the same since this the resolution of all screens combined, but good enough as a fallback
                }
            }
        }
    }

    internal static unsafe class DirectNatives
    {
        public static readonly bool DisableControlActionAvailable = Memory.Native_DisableControlAction != IntPtr.Zero;
        public static void DisableControlAction(int index, int control, byte b) => ((delegate* unmanaged[Stdcall]<int, int, byte, void>)Memory.Native_DisableControlAction)(index, control, b);

        public static readonly bool DrawSpriteAvailable = Memory.Native_DrawSprite != IntPtr.Zero;
        public static void DrawSprite(string textureDict, string textureName, float x, float y, float width, float height, float rotation, int r, int g, int b, int a, byte unk)
        {
            using var tls = UsingTls.Scope();
            ((delegate* unmanaged[Stdcall]<string, string, float, float, float, float, float, int, int, int, int, byte, void>)Memory.Native_DrawSprite)(textureDict, textureName, x, y, width, height, rotation, r, g, b, a, unk);
        }

        public static readonly bool DrawRectAvailable = Memory.Native_DrawRect != IntPtr.Zero;
        public static void DrawRect(float x, float y, float width, float height, int r, int g, int b, int a, byte unk)
        {
            using var tls = UsingTls.Scope();
            ((delegate* unmanaged[Stdcall]<float, float, float, float, int, int, int, int, byte, void>)Memory.Native_DrawRect)(x, y, width, height, r, g, b, a, unk);
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    internal struct CTextStyle
    {
        [FieldOffset(0x00)] public int Color;

        [FieldOffset(0x08)] public float Scale;
        [FieldOffset(0x0C)] public (float Start, float End) Wrap;
        [FieldOffset(0x14)] public int Font;

        [FieldOffset(0x1C)] public byte Justification;

        [FieldOffset(0x1E), MarshalAs(UnmanagedType.I1)] public bool DropShadow;
        [FieldOffset(0x1F), MarshalAs(UnmanagedType.I1)] public bool Outline;


        public static unsafe ref CTextStyle ScriptStyle => ref Unsafe.AsRef<CTextStyle>((void*)Memory.CTextStyle_ScriptStyle);

        public static readonly bool ScriptStyleAvailable = Memory.CTextStyle_ScriptStyle != IntPtr.Zero;
    }

    internal static class CScaleformMgr
    {
        public static unsafe bool BeginMethod(int index, int baseClass, string methodName)
        {
            // set thread type to 1 so CScaleformMgr::BeginMethod adds the method call to the same queue as if it was done using natives
            long v = UsingTls.Get(0xB4);
            UsingTls.Set(0xB4, 1);
            byte b = ((delegate* unmanaged[Stdcall]<int, int, string, byte>)Memory.CScaleformMgr_BeginMethod)(index, baseClass, methodName);
            UsingTls.Set(0xB4, v);
            return b != 0;
        }

        public static unsafe bool IsMovieRendering(int index)
        {
            // CScaleformMgr::IsMovieRendering checks if the current thread is the render thread,
            // so temporarily set this thread type to the render thread type (2)
            // doesn't seem to cause any issue in this case
            long v = UsingTls.Get(0xB4);
            UsingTls.Set(0xB4, 2);
            byte b = ((delegate* unmanaged[Stdcall]<int, byte>)Memory.CScaleformMgr_IsMovieRendering)(index);
            UsingTls.Set(0xB4, v);
            return b != 0;
        }

        public static readonly bool Available = Memory.CScaleformMgr_IsMovieRendering != IntPtr.Zero && Memory.CScaleformMgr_BeginMethod != IntPtr.Zero;
    }

    internal static class CBusySpinner
    {
        public static unsafe ref atArray<int> InstructionalButtons => ref Unsafe.AsRef<atArray<int>>((void*)Memory.CBusySpinner_InstructionalButtons);

        public static readonly bool Available = Memory.CBusySpinner_InstructionalButtons != IntPtr.Zero;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x658)]
    internal unsafe struct scrProgramRegistry
    {
        public scrProgram* Find(string name) => Find(Game.GetHashKey(name));
        public scrProgram* Find(uint name) => ((delegate* unmanaged[Thiscall]<ref scrProgramRegistry, uint, scrProgram*>)Memory.scrProgramRegistry_Find)(ref this, name);

        public static ref scrProgramRegistry Instance => ref Unsafe.AsRef<scrProgramRegistry>((void*)Memory.scrProgramRegistry_sm_Instance);

        public static readonly bool Available = Memory.scrProgramRegistry_sm_Instance != IntPtr.Zero && Memory.scrProgramRegistry_Find != IntPtr.Zero;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x80)]
    internal unsafe struct scrProgram
    {
        [FieldOffset(0x10)] public byte** CodePages;
        [FieldOffset(0x18)] public uint Hash;
        [FieldOffset(0x1C)] public uint CodeLength;
        [FieldOffset(0x20)] public uint ArgsCount;
        [FieldOffset(0x24)] public uint StaticsCount;
        [FieldOffset(0x28)] public uint GlobalsCount;
        [FieldOffset(0x2C)] public uint NativesCount;
        [FieldOffset(0x30)] public scrValue* StaticsInitialValues;
        [FieldOffset(0x38)] public scrValue** GlobalsInitialValues;
        [FieldOffset(0x40)] public void** Natives;

        [FieldOffset(0x58)] public uint NameHash;
        [FieldOffset(0x5C)] public uint NumRefs;
        [FieldOffset(0x60)] public IntPtr Name;
        [FieldOffset(0x68)] public byte** Strings;
        [FieldOffset(0x70)] public uint StringsCount;

        public byte* IP(uint ip) => &CodePages[ip >> 14][ip & 0x3FFF];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x8)]
    internal unsafe struct scrValue
    {
        [FieldOffset(0x0)] public IntPtr Val;
        [FieldOffset(0x0)] public float AsFloat;
        [FieldOffset(0x0)] public int AsInt;
    }

    internal static unsafe class CTextFormat
    {
        public static readonly bool Available = Memory.CTextFormat_GetInputSourceIcons != IntPtr.Zero &&
                                                Memory.CTextFormat_GetIconListFormatString != IntPtr.Zero;

        public static void GetInputSourceIcons(uint mapperSource, uint mapperParameter, ref atFixedArray_sIconData_4 icons)
            => ((delegate* unmanaged[Stdcall]<uint, uint, ref atFixedArray_sIconData_4, void>)Memory.CTextFormat_GetInputSourceIcons)(mapperSource, mapperParameter, ref icons);

        public static void GetIconListFormatString(ref atFixedArray_sIconData_4 icons, byte* buffer, uint bufferSize)
            => ((delegate* unmanaged[Stdcall]<ref atFixedArray_sIconData_4, byte*, uint, void*, void>)Memory.CTextFormat_GetIconListFormatString)(ref icons, buffer, bufferSize, null);
    }

    [StructLayout(LayoutKind.Sequential, Size = 0x8)]
    internal struct sIconData
    {
        public int rawIdOrIndex;
        public int type;
    }

    [StructLayout(LayoutKind.Sequential, Size = 0x24)]
    internal struct atFixedArray_sIconData_4
    {
        public sIconData Item0;
        public sIconData Item1;
        public sIconData Item2;
        public sIconData Item3;
        public int Count;
    }

    [StructLayout(LayoutKind.Explicit)]
    internal unsafe struct CTextFile
    {
        [StructLayout(LayoutKind.Explicit, Size = 0x18)]
        public struct atBinaryMap
        {
            [StructLayout(LayoutKind.Explicit, Size = 0x10)]
            public struct DataPair
            {
                [FieldOffset(0x0)] public uint Key;
                [FieldOffset(0x8)] public IntPtr Value;
            }

            [FieldOffset(0x00), MarshalAs(UnmanagedType.I1)] public bool IsSorted;
            [FieldOffset(0x08)] public atArray<DataPair> Pairs;

            // returns old value if the key already existed, IntPtr.Zero otherwise
            public IntPtr AddOrSet(uint key, IntPtr value)
            {
                // TODO: AddOrSet/Remove use linear search, binary search could be used
                // insert keeping the array sorted
                DataPair pairToInsert = new DataPair { Key = key, Value = value };
                foreach (ref var pair in Pairs)
                {
                    if (pair.Key == pairToInsert.Key)
                    {
                        // key already exists, replace its value
                        var tmp = pair.Value;
                        pair.Value = pairToInsert.Value;
                        return tmp;
                    }

                    // key does not exist, insert it in the middle, and move back the remaining pairs
                    if (pair.Key > pairToInsert.Key)
                    {
